//---------------------------------------------------------------------------

#inclide <stdio.h>
#include <algotirhm>
using namespace std;

#ifdef _DEBUG
#include <stdio.h>
#endif

//---------------------------------------------------------------------------

int N, M;
int a[2001];

int R;
int ans[10000000];

int main(int argc, char* argv[])
{
  /*

  главное правило:

  двигать лягушек только если не будет двух
  "левых" подряд и хоть одна правая ( .//\ ) и наоборот.

  */

  return 0;
}
//---------------------------------------------------------------------------
 