
<?php
	define('SITE_ROOT', '/home/http/php/groupSite');
	define('HOMEPAGE', '/php/groupSite/htdocs');
	
	define('SUBJ_PER_PAGE', 5);

	define('ARCHIVE_ID', 10000);

	$errors = array(
		'OK' => 'Нет ошибок.',
		'DB' => 'Ошибка подключения к базе данных.',
		'QUERY' => 'Ошибка в запросе.',
		'SESS' => 'Ошибка генерации сессии.',
		'USERPASSW' => 'Неправильный логин/пароль.',
		'PASSW' => 'Неправильный пароль.',
		'404' => 'Неправильные данные от браузера.', 
		'DATA' => 'Неправильные данные от браузера.', 
		'UNKUSER' => 'Пользователь не существует.',
		'PERM' => 'Нехватает прав.',
		'NOSUBJ' => 'Раздел не существует.',
		'NOART' => 'Статья не существует.'
	);
	
	$register_errors = array(
		'NAME' => 'Имя пользователя должно содержать только латинские символы, цифры или знаки подчеркивания. Максимальная длинна - 128 символов.',
		'EXISTS' => 'Пользователь с таким именем существует.',
		'PASSW' => 'Пароли не совпадают или меньше 5 символов.',
		'EMAIL' => 'E-Mail неправильный.'
	);

	$gender_strings = array (
		'A' => 'не указан',
		'M' => 'мужской',
		'F' => 'женский'
	);

	$access_strings = array (
		-1 =>'забаненный',
		0  =>'незарегистрированный',
		1  =>'обычный пользователь',
		2  =>'модератор',
		3  =>'администратор'
	);
	
?>
